app/views/tutor_sessions/_tutor_session.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
				<h4 class="subject card-title name"><%= tutor_session.subject%></h4>
				<h5 class="card-subtitle mb-2 text-muted">with <span class="name"><%= User.find(tutor_session.user_id).firstname %></span></h5>

SELECT  "tutors".* FROM "tutors" WHERE "tutors"."user_id" = ? AND "tutors"."user_id" = ? LIMIT ?  [["user_id", 3], ["user_id", 3], ["LIMIT", 1]]
---
				<h4 class="subject card-title name"><%= tutor_session.subject%> </h4>
				<h5 class="card-subtitle mb-2 text-muted">with <span class="name"><%= User.find(tutor_session.tutor_id).firstname %></span></h5>