app/views/users/show.html.erb

SELECT  "tutors".* FROM "tutors" WHERE "tutors"."user_id" = ? AND "tutors"."user_id" = ? LIMIT ?  [["user_id", 2], ["user_id", 2], ["LIMIT", 1]]
---
      </br>
      <p><strong>School: </strong><span class="name"><%= @user.tutors.find(@user.id).school %></span> </p>

SELECT "tutors".* FROM "tutors" INNER JOIN "students_tutors" ON "tutors"."user_id" = "students_tutors"."tutor_id" WHERE "students_tutors"."student_id" = ?  [["student_id", 6]]
SELECT COUNT(*) FROM "tutors" INNER JOIN "students_tutors" ON "tutors"."user_id" = "students_tutors"."tutor_id" WHERE "students_tutors"."student_id" = ?  [["student_id", 6]]
SELECT  1 AS one FROM "tutor_sessions" WHERE "tutor_sessions"."student_id" = ? LIMIT ?  [["student_id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "tutors" INNER JOIN "students_tutors" ON "tutors"."user_id" = "students_tutors"."tutor_id" WHERE "students_tutors"."student_id" = ? LIMIT ?  [["student_id", 6], ["LIMIT", 1]]
SELECT "tutor_sessions".* FROM "tutor_sessions" WHERE "tutor_sessions"."user_id" = ? ORDER BY "tutor_sessions"."created_at" DESC  [["user_id", 2]]
---
  <section class="tutor_session">
  <h2>Sessions (<%= @user.tutor_sessions.count + TutorSession.where(student_id: @user.id).count + TutorSession.where(tutor_id: @user.id).count %>)</h2>
  <% if @user.tutor_sessions.any? || TutorSession.where(student_id: @user.id).any? || TutorSession.where(tutor_id: @user.id).any? %>

SELECT "students".* FROM "students" INNER JOIN "students_tutors" ON "students"."user_id" = "students_tutors"."student_id" WHERE "students_tutors"."tutor_id" = ?  [["tutor_id", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
          <select name="tutor_session[tutor_id]">
            <% @user.students.find(@user.id).tutors.all.each do |t| %>
              <option value="<%= t.user_id %>"><%= User.find(t.user_id).firstname + " " + User.find(t.user_id).lastname%></option>

SELECT COUNT(*) FROM "students" INNER JOIN "students_tutors" ON "students"."user_id" = "students_tutors"."student_id" WHERE "students_tutors"."tutor_id" = ?  [["tutor_id", 2]]
SELECT  1 AS one FROM "students" INNER JOIN "students_tutors" ON "students"."user_id" = "students_tutors"."student_id" WHERE "students_tutors"."tutor_id" = ? LIMIT ?  [["tutor_id", 2], ["LIMIT", 1]]
---

    <p><strong>Number of tutors: </strong> <%= @user.students.find(@user.id).tutors.count %> </p>
    <% if @user.students.find(@user.id).tutors.any? %>