app/views/welcome/tutors.html.erb


<% User.where(role: "Tutor").each do |user| %>
---
SELECT "users".* FROM "users" WHERE "users"."role" = ?  [["role", "Tutor"]]

		<p><strong>Education level: </strong><%= user.education_level %></p>
	 	<% Tutor.where(user_id: user.id).each do |tutor| %>
---
SELECT  "tutors".* FROM "tutors" WHERE "tutors"."user_id" = ? AND "tutors"."user_id" = ? LIMIT ?  [["user_id", 7], ["user_id", 2], ["LIMIT", 1]]

      <p><strong>Comments from the students:</strong></p>
        <% user.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 2]]

		    <% if current_user.role == "Student" %>
				<% if current_user.students.find(current_user.id).tutors.exists?(tutor.user_id) %>
---
SELECT  "students".* FROM "students" WHERE "students"."user_id" = ? AND "students"."user_id" = ? LIMIT ?  [["user_id", 7], ["user_id", 7], ["LIMIT", 1]]
SELECT  "tutors".* FROM "tutors" INNER JOIN "students_tutors" ON "tutors"."user_id" = "students_tutors"."tutor_id" WHERE "students_tutors"."student_id" = ? AND "tutors"."user_id" = ? LIMIT ?  [["student_id", 7], ["user_id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "tutors" INNER JOIN "students_tutors" ON "tutors"."user_id" = "students_tutors"."tutor_id" WHERE "students_tutors"."student_id" = ? AND "tutors"."user_id" = ? LIMIT ?  [["student_id", 7], ["user_id", 2], ["LIMIT", 1]]