app/controllers/comments_controller.rb

  def create
    @user = User.find(params[:user_id])
    @comment = @user.comments.create(comment_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "aaaa"], ["user_id", 2], ["created_at", "2018-04-05 00:50:40.035302"], ["updated_at", "2018-04-05 00:50:40.035302"]]