app/controllers/tutor_sessions_controller.rb

    def create
        @tutor_session = current_user.tutor_sessions.build(sessions_params)
        if @tutor_session.save
---
INSERT INTO "tutor_sessions" ("subject", "created_at", "updated_at", "date", "starttime", "endtime", "time_duration", "user_id", "student_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def edit
        @tutor_session = current_user.tutor_sessions.find_by(id:current_user.tutor_sessions.ids)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

    def update
        @tutor_session = current_user.tutor_sessions.find_by(id:current_user.tutor_sessions.ids)

        if @tutor_session.update(sessions_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "tutor_sessions" SET "starttime" = ?, "endtime" = ?, "updated_at" = ? WHERE "tutor_sessions"."id" = ?  [["starttime", "2000-01-01 12:00:00"], ["endtime", "2000-01-01 14:00:00"], ["updated_at", "2018-03-29 23:55:41.957281"], ["id", 5]]

    def destroy
        @tutor_session = current_user.tutor_sessions.find_by(id:current_user.tutor_sessions.ids)
        @tutor_session.destroy
---
SELECT  "tutor_sessions".* FROM "tutor_sessions" WHERE "tutor_sessions"."user_id" = ? AND "tutor_sessions"."id" = 4 ORDER BY "tutor_sessions"."created_at" DESC LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tutor_sessions" WHERE "tutor_sessions"."id" = ?  [["id", 4]]