app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @totalHours = 0
    @user = User.find(params[:id])

INSERT INTO "users" ("firstname", "lastname", "username", "gender", "role", "location", "created_at", "updated_at", "password_digest", "education_level") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "tutors" ("user_id", "school", "created_at", "updated_at", "rate", "bio", "subjects") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "students" ("user_id", "created_at", "updated_at", "need_parent", "parent_firstname", "parent_lastname") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 10], ["created_at", "2018-04-02 22:50:09.507049"], ["updated_at", "2018-04-02 22:50:09.507049"], ["need_parent", "f"], ["parent_firstname", "none"], ["parent_lastname", "none"]]
---
  def create
    @user = User.new(user_params)
    if @user.save
      if @user.role == "Tutor"
        @tutor = @user.tutors.create(attributes = { school: "Please update school name", rate: 10.0, bio: "Please tell us a little more about yourself", subjects: "Please list all the subjects and levels you can tutor"})
      elsif @user.role == "Student"
        # print "creating student account"
        @student = @user.students.create(need_parent: false, parent_firstname: "none", parent_lastname: "none")

SELECT  "tutors".* FROM "tutors" WHERE "tutors"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."user_id" = ? LIMIT ?  [["user_id", 7], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def create_student_tutor
    @tutor = Tutor.find(params[:tutor_id])
    @user = Student.find(params[:student_id])
    @user.tutors << @tutor

    redirect_to User.find(params[:student_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "firstname" = ?, "lastname" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["firstname", "Betty "], ["lastname", "Cooper"], ["password_digest", "$2a$10$MvT40YPzQ0ZvxkqRjbliNuYeLQJAXc.8.BBZ4CyMYhGgUVWpqTqra"], ["updated_at", "2018-04-03 00:14:12.729607"], ["id", 5]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)